// Modal window
// "Modal window з детальною інформацією про книгу включає
//   зображення обгортки цієї книги
//   назву книги
//   її автора
//   короткий опис змісту книги
//   перелік посилань на торгівельні майданчики, де цю книгу можна придбати
//   та кнопку додавання книги до Shopping list або видалення з нього"
// Click по логотипу торгівельного майданчика повинен відкривати його оригінальний ресурс в окремій вкладці браузера, де користувач матиме змогу придбати цю книгу 
// Click по кнопці додавання книги до Shopping list або видалення з нього повинен оновлювати інформацію про list, яка повинна зберігатися в localStorage
// Click по backdrop модального вікна, click по кнопці з іконкою хрестика або натискання на клавішу ESC повинен закривати модальне вікно (не забувайте знімати слухачі)

// click on book by ID
// close X and escape